wellin265/esp32_linux_demo/demo/lcd_example/main/APP/BLE/ble.cpp
extern "C" {

bool ble_spp_send(const uint8_t *data, size_t len)
{
    if (!is_connected || !enable_data_ntf) {
        return false;
    }
    if (len > (spp_mtu_size - 3)) {
        ESP_LOGW(GATTS_TABLE_TAG, "ble_spp_send: data too long (%u > %u)", len, spp_mtu_size - 3);
        return false;
    }
    esp_err_t ret = esp_ble_gatts_send_indicate(spp_gatts_if, spp_conn_id,
        spp_handle_table[SPP_IDX_SPP_DATA_NTY_VAL], len, (uint8_t *)data, false);
    return ret == ESP_OK;
}

bool ble_is_connected(void)
{
    return is_connected;
}

bool ble_get_received(char *buf, size_t max_len)
{
    if (!s_rx_data_new) {
        return false;
    }
    strncpy(buf, s_last_rx_data, max_len - 1);
    buf[max_len - 1] = '\0';
    s_rx_data_new = false;
    return true;
}

/* ========== BLE 主任务 ========== */

extern Lcd *g_lcd;

void bleTask(void *pvParameters)
{
    esp_err_t ret;
    esp_bt_controller_config_t bt_cfg = BT_CONTROLLER_INIT_CONFIG_DEFAULT();

    /* 释放经典蓝牙内存 */
    ESP_ERROR_CHECK(esp_bt_controller_mem_release(ESP_BT_MODE_CLASSIC_BT));

    /* 初始化并启用 BLE 控制器 */
    ret = esp_bt_controller_init(&bt_cfg);
    if (ret) {
        ESP_LOGE(GATTS_TABLE_TAG, "%s init controller failed: %s", __func__, esp_err_to_name(ret));
        goto end;
    }
    ret = esp_bt_controller_enable(ESP_BT_MODE_BLE);
    if (ret) {
        ESP_LOGE(GATTS_TABLE_TAG, "%s enable controller failed: %s", __func__, esp_err_to_name(ret));
        goto end;
    }

    /* 初始化 Bluedroid */
    ESP_LOGI(GATTS_TABLE_TAG, "%s init bluetooth", __func__);
    ret = esp_bluedroid_init();
    if (ret) {
        ESP_LOGE(GATTS_TABLE_TAG, "%s init bluedroid failed: %s", __func__, esp_err_to_name(ret));
        goto end;
    }
    ret = esp_bluedroid_enable();
    if (ret) {
        ESP_LOGE(GATTS_TABLE_TAG, "%s enable bluedroid failed: %s", __func__, esp_err_to_name(ret));
        goto end;
    }

    /* 初始化 UART 和队列 (必须在 BLE 注册之前, 防止回调中访问空队列) */
    spp_task_init();

    /* 注册 GATT/GAP 回调并启动服务 */
    esp_ble_gatts_register_callback(gatts_event_handler);
    esp_ble_gap_register_callback(gap_event_handler);
    esp_ble_gatts_app_register(ESP_SPP_APP_ID);

    ESP_LOGI(GATTS_TABLE_TAG, "BLE SPP server started, waiting for connection...");

    /* 轮询 BLE 接收数据并显示到 LCD */
    {
        char rx_buf[128];
        while (1) {
            if (ble_get_received(rx_buf, sizeof(rx_buf))) {
                ESP_LOGI(GATTS_TABLE_TAG, "BLE rx: %s", rx_buf);
                g_lcd->fill(0, 180, 320, 240, BLACK);
                g_lcd->showString(10, 190, 300, 240, 16, rx_buf, WHITE);
            }
            vTaskDelay(pdMS_TO_TICKS(200));
        }
    }

end:
    /* 初始化失败时删除自身任务 */
    vTaskDelete(NULL);
}

}  /* extern "C" */